Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: The concept is similar to your hard disk directory structure, except that in this context, the root directory is "The world" and the first level subdirectories are "countries ".
es: El concepto es similar a la estructura de directorios de los discos duros, pero en este caso, el directorio raiz es "El Mundo" y los subdirectorios de primer nivel son los "países ".

source: Lower levels of the directory structure contain entries for companies, organisations or places, while yet lower still we find directory entries for people, and perhaps equipment or documents.
es: Niveles inferiores de la estructura de directorio contienen entradas para compañías, organizaciones o lugares, y en niveles aún inferiores se encuentran las entradas para la gente, y quizás de equipos informáticos y documentos.

source: To refer to a file in a subdirectory on your hard disk, you might use something like:
es: Para referirse a un fichero en un subdirectorio del disco duro se usa algo como

source: /usr / local / myapp / docs
es: /usr / local / misapps / docs

source: The forwards slash marks each division in the reference, and the sequence is read from left to right.
es: Las barras marcan cada división en la referencia al fichero, y la secuencia es leida de izquierda a derecha.

source: An example dn might be:
es: El equivalente a la referencia a un fichero en LDAP es el "distinguished name" (nombre distinguible), abreviado como "db ".

source: cn=John Smith,ou=Accounts,o=My Company,c=US
es: Un ejemplo de dn podría ser.

source: The comma marks each division in the reference, and the sequence is read from right to left.
es: cn=Pedro Pérez,ou=Contabilidad,o=Mi Compañía,c=ES

source: country = US organization = My Company organizationalUnit = Accounts commonName = John Smith
es: Las comas marcan cada división en la referencia, y la secuencia se lee de derecha a izquierda.

source: However, there are some conventions that are used.
es: country = ES organization = Mi Compañía organizationalUnit = Contabilidad commonName = Pedro Pérez

source: Lots of information about LDAP can be found at
es: De la misma manera que no hay reglas estrictas sobre como organizar la estructura de directorios de un disco duro, un administrador de un servidor de directorio puede establecer cualquier estructura que sea útil para sus propósitos.

source: OpenLDAP Project
es: Sin embargo hay algunos acuerdos tácitos que siempre deben seguirse.

source: You will need to get and compile LDAP client libraries from either the University of Michigan ldap-3.3 package or the Netscape Directory SDK 3.0 to compile PHP with LDAP support.
es: El mensaje es que no se puede escribir código para acceder un directorio si no se conoce algo de su estructura, igual que no se puede usar una base de datos sin algún conocimiento sobre lo que está disponible en ella.

source: You will need to use the --with-ldap[ =DIR] configuration option when compiling PHP to enable LDAP support.
es: Recuperar informacion para todas las entradas donde el apellido empiece por "P" de un servidor de directorio, mostrando un extracto con el nombre y dirección de correo electrónico.

source: Note to Win32 Users:
es: Ejemplo 1. ejemplo de búsqueda LDAP

source: C:\WINNT\SYSTEM32 or C:\WINDOWS\SYSTEM32)
es: ?php / / La secuencia básica para trabajar con LDAP es conectar, autentificarse, / / buscar, interpretar el resultado de la búsqueda y cerrar la conexión. echo "h3 Prueba de consulta LDAP / h3"; echo "Conectando.. ."; $ds=ldap_connect("localhost"); / / Debe ser un servidor LDAP válido! echo "El resultado de la conexión es ".$ds. "p"; if ($ds) {echo "Autentificandose.. ."; $r=ldap_bind($ds); / / Autentificación anónima, típicamente con / / acceso de lectura echo "El resultado de la autentificación es ".$r. "p"; echo "Buscando (sn=P*).. ."; / / Busqueda de entradas por apellidos $sr=ldap_search($ds ,"o=Mi Compañia, c=ES", "sn=P*"); echo "El resultado de la búsqueda es ".$sr. "p"; echo "El número de entradas devueltas es ".ldap_count_entries($ds,$sr). "p"; echo "Recuperando entradas... p "; $info = ldap_get_entries($ds, $sr); echo "Devueltos datos de ".$info["count"]." entradas: p "; for ($i=0; $i $info["count"]; $i++) {echo "dn es:". $info[$i]["dn"]. "br"; echo "La primera entrada cn es: ". $info[$i]["cn"][0]." br "; echo "La primera entrada email es:". $info[$i]["mail"][0]. "p";} echo "Cerrando conexión"; ldap_close($ds);} else {echo "h4 Ha sido imposible conectar al servidor LDAP / h4";}?

source: ldap.max_links
es: Antes de usarse las llamadas LDAP se debe saber..

source: Before you can use the LDAP calls you will need to know..
es: La secuencia típica de llamadas LDAP suele implementarse en aplicaciones que siguen el siguiente patrón:

source: The "base dn" of the server (the part of the world directory that is held on this server, which could be "o=My Company,c=US")
es: ldap_connect() / / establecer la conexión con el servidor _BAR_ ldap_bind() / / login anónimo o autentificado _BAR_ Hacer búsquedas o actualizaciones en el directorio y mostrar los resultados _BAR_ ldap_close() / / Cerrar la conexión

source: Whether you need a password to access the server (many servers will provide read access for an "anonymous bind "but require a password for anything else)
es: Mucha información acerca de LDAP puede ser consultada en

source: The typical sequence of LDAP calls you will make in an application will follow this pattern:
es: Proyecto OpenLDAP

source: ldap_connect() / / establish connection to server _BAR_ ldap_bind() / / anonymous or authenticated "login "_BAR_ do something like search or update the directory and display the results _BAR_ ldap_close() / / "logout"
es: El SDK de Netscape contiene una Guía de Programación muy útil en formato html.

source: For example, Qmail users can normally set it to / var / qmail / bin / sendmail or / var / qmail / bin / qmail-inject.
es: The mail() Funciones que permiten enviar correo.

source: mail
es: Siguiente

source: mailparse_determine_best_xfer_encoding
es: Subir

source: If you need to handle bigger numbers, take a look at the arbitrary precision math functions.
es: Estas funciones matemáticas solo manejan valores dentro de los rangos de los tipos long y double de su ordenador.

source: sqrt( pi) [4.0.2]
es: Constantes matemáticas

source: 2 / sqrt( pi)
es: Constante

source: sqrt( 2)
es: Valor

source: sqrt( 3) [4.0.2]
es: Descripción

source: Euler constant [4.0.2]
es: El valor de ¶ (pi)

source: Example 1. php.ini setting example
es: Ejemplo 1. php.ini setting example

source: Example 2. php.ini setting for EUC-JP users
es: Ejemplo 2. php.ini setting for EUC-JP users

source: Example 3. php.ini setting for SJIS users
es: Ejemplo 3. php.ini setting for SJIS users

source: Example 4.
es: Ejemplo 4.

source: Example 5. php.ini setting example
es: Ejemplo 5. php.ini setting example

source: Example 6.
es: Ejemplo 6.

source: Note: "Supported character encoding" does not mean that it works as internal character code.
es: Nota: "Supported character encoding" does not mean that it works as internal character code.

source: MCAL is the calendar equivalent of the IMAP module for mailboxes.
es: It 's written to be very modular, with plugable drivers.

source: Most of the functions use an internal event structure that is unique for each stream.
es: There is also support for calendar triggers (alarms) and reoccuring events.

source: There are convenience functions for setting, initializing, and retrieving the event structure values.
es: With libmcal, central calendar servers can be accessed and used, removing the need for any specific database or local file programming.

source: PHP had an ICAP extension previously, but the original library and the PHP extension is not supported anymore.
es: To get these functions to work, you have to compile PHP with --with-mcal.

source: The suggested replacement is MCAL.
es: That requires the mcal library to be installed.

source: This extension requires the mcal library to be installed.
es: The following constants are defined when using the MCAL module:

source: After you installed the mcal library, to get these functions to work, you have to compile PHP -with-mcal[ =DIR].
es: MCAL_SUNDAY, MCAL_MONDAY, MCAL_TUESDAY, MCAL_WEDNESDAY, MCAL_THURSDAY, MCAL_FRIDAY, MCAL_SATURDAY, MCAL_RECUR_NONE, MCAL_RECUR_DAILY, MCAL_RECUR_WEEKLY, MCAL_RECUR_MONTHLY_MDAY, MCAL_RECUR_MONTHLY_WDAY, MCAL_RECUR_YEARLY, MCAL_JANUARY, MCAL_FEBRUARY, MCAL_MARCH, MCAL_APRIL, MCAL_MAY, MCAL_JUNE, MCAL_JULY, MCAL_AUGUGT, MCAL_SEPTEMBER, MCAL_OCTOBER, MCAL_NOVEMBER, and MCAL_DECEMBER.

source: Additionally, it supports RC6 and IDEA which are considered "non-free".
es: Esta es una interfaz a la librería mcrypt, que soporta una gran variedad de algoritmos de bloque como DES, TripleDES, Blowfish (por defecto), 3-WAY, SAFER-SK64, SAFER-SK128, TWOFISH, TEA, RC2 y GOST en los modos de cifrado CBC, OFB, CFB y ECB.

source: To use it, download libmcrypt-x.x.tar.gz from here and follow the included installation instructions.
es: Adicionalmente, soporta RC6 e IDEA que se consideran "no-libres".

source: If you linked against libmcrypt 2.4.x or higher, the following additional block algorithms are supported:
es: Para usarlos, descarga libmcrypt-x.x.tar.gz de aquí y sigue las instrucciones de instalación incluidas.

source: ENIGMA (crypt), PANAMA, RC4 and WAKE.
es: Necesitas compilar PHP con el parámetro --with-mcrypt para activar esta extensión.

source: You need to compile PHP with the --with-mcrypt[ =DIR] parameter to enable this extension.
es: mcrypt puede usarse para encriptar y desencriptar usando los cifrados mencionados arriba.

source: Mcrypt configuration options
es: Ejemplo 1.

source: mcrypt.algorithms_dir
es: Encripta un valor de entrada con TripleDES en modo ECB

source: If linked against libmcrypt-2.4.x or higher the functions can also operate in the block cipher mode nOFB and in STREAM mode.
es: mcrypt puede operar en cuatro modos de cifrado (CBC, OFB, CFB y ECB).

source: For a more complete reference and discussion see Applied Cryptography by Schneier (ISBN 0-471-11709-9).
es: Perfilaremos el uso normal de cada uno de estos modos.

source: Since data there is short and random, the disadvantages of ECB have a favorable negative effect.
es: Para una mejor referencia y una discusión más completa ver Applied Cryptography by Schneier (ISBN 0-471-11709-9).

source: MCRYPT_MODE_CFB (cipher feedback) is the best mode for encrypting byte streams where single bytes must be encrypted.
es: ECB (electronic codebook o libro de códigos electrónico) va bien para datos aleatorios, tales como encriptar otras claves.

source: It' s insecure (because it operates in 8bit mode) so it is not recommended to use it.
es: Puesto que los datos son cortos y aleatorios, las desventajas de ECB tienen un efecto negativo favorable.

source: MCRYPT_MODE_STREAM is an extra mode to include some stream algorithms like WAKE or RC4.
es: CBC (cipher block chaining o cifrado en bloque encadenado) es especialmente útil para encriptar ficheros, donde incrementa significativamente la seguridad por encima de ECB.

source: Here is a list of ciphers which are currently supported by the mcrypt extension.
es: CFB (cipher feedback o cifrado realimentado) es el mejor modo de encriptar flujos de bytes donde cada byte debe ser encriptado.

source: The general rule with the mcrypt-2.2.x API is that you can access the cipher from PHP with MCRYPT_ciphername.
es: OFB (output feedback o salida realimentada) es comparable al CFB, pero puede usarse en aplicaciones donde la propagación de errores no puede tolerarse.

source: With the libmcrypt-2.4.x and libmcrypt-2.5.x API these constants also work, but it is possible to specify the name of the cipher as a string with a call to mcrypt_module_open().
es: Actualmente PHP no soporta el encriptado / desencriptado de flujos de bits.

source: MCRYPT_ARCFOUR_IV (libmcrypt 2.4.x only)
es: Por ahora, sólo soporta el manejo de cadenas.

source: MCRYPT_BLOWFISH
es: Para una lista completa de los cifrados soportados, ver las definiciones al final de mcrypt.h.

source: MCRYPT_CAST_256
es: La regla general es que se puede acceder al cifrado desde PHP con MCRYPT_nombredelcifrado.

source: MCRYPT_DES
es: Aquí hay una pequeña lista de los cifrados que estan soportados actualmente por la extensión mcrypt.

source: MCRYPT_ENIGMA (libmcrypt 2.4.x only, alias for MCRYPT_CRYPT)
es: Si un cifrado no está listado aquí, pero está listado por mcrypt como soportado, puedes asumir con seguridad que ésta documentación está caduca.

source: MCRYPT_RIJNDAEL_128 (libmcrypt 2.4.x only)
es: MCRYPT_TripleDES

source: MCRYPT_RIJNDAEL_256 (libmcrypt 2.4.x only)
es: MCRYPT_ThreeWAY

source: MCRYPT_RC6_256 (libmcrypt 2.2.x only)
es: MCRYPT_DES_COMPAT

source: MCRYPT_SERPENT_192 (libmcrypt 2.2.x only)
es: MCRYPT_CAST128

source: MCRYPT_SKIPJACK (libmcrypt 2.4.x only)
es: MCRYPT_TEAN

source: MCRYPT_TWOFISH (for older mcrypt 2.x versions, or mcrypt 2.4.x)
es: MCRYPT_TWOFISH (para las antiguas versiones mcrypt 2.x)

source: MCRYPT_TWOFISH192
es: MCRYPT_TWOFISH128 (TWOFISHxxx está disponible en las versiones más nuevas 2.x)

source: The IV must be unique and must be the same when decrypting / encrypting.
es: MCRYPT_RC6

source: Alternatively, you can transmit the IV together with the encrypted data (see chapter 9.3 of Applied Cryptography by Schneier (ISBN 0-471-11709-9) for a discussion of this topic).
es: MCRYPT_IDEA

source: If you linked against libmcrypt-2.2.x, the four important mcrypt commands (mcrypt_cfb(), mcrypt_cbc(), mcrypt_ecb(), and mcrypt_ofb()) can operate in both modes which are named MCRYPT_ENCRYPT and MCRYPT_DECRYPT, respectively.
es: Debes (en los modos CFB y OFB) o puedes (en el modo CBC) suministrar un vector de inicialización (IV) a la correspondiente función de cifrado.

source: Encrypt an input value with TripleDES under 2.2.x in ECB mode
es: El IV debe ser único y debe ser el mismo cuando desencriptas o encriptas.

source: If you linked against libmcrypt 2.4.x or 2.5.x, these functions are still available, but it is recommended that you use the advanced functions.
es: Con datos que son guardados encriptados, puedes cojer la salida de una función de índice bajo la cual los datos son almacenados (ej. la clave MD5 de un fichero).

source: ?php $key = "this is a secret key"; $input = "Let us meet at 9 o'clock at the secret place ."; $td = mcrypt_module_open ('tripledes', '', 'ecb', ''); $iv = mcrypt_create_iv (mcrypt_enc_get_iv_size ($td), MCRYPT_RAND); mcrypt_generic_init ($td, $key, $iv); $encrypted_data = mcrypt_generic ($td, $input); mcrypt_generic_deinit ($td); mcrypt_module_close ($td);?
es: Alternativamente, puedes transmitir el IV junto con los datos encriptados (ver capítulo 9.3 de Applied Cryptography by Schneier (ISBN 0-471-11709-9) para una discusión de éste asunto).

source: Mhash can be used to create checksums, message digests, message authentication codes, and more.
es: Estas funciones han sido realizadas para trabajar con mhash.

source: For a complete list of supported hashes, refer to the documentation of mhash.
es: Esta es una interfaz con al libreria mhash. mhash soporta una amplia variedad de algoritmos hash como MD5, SHA1, GOST, y muchos otros.

source: For example, to access TIGER you use the PHP constant MHASH_TIGER.
es: Para usarla, hay que descargar la distribucion desde su sitio web y seguir las intrucciones de instalacion.

source: To use it, download the mhash distribution from its web site and follow the included installation instructions.
es: Se necesita compilar PHP con el parametr --with-mhash para activar esta extension.

source: You need to compile PHP with the --with-mhash[ =DIR] parameter to enable this extension.
es: mhash puede ser usado para crear checksums, message digests, y mas.

source: DIR is the mhash install directory.
es: Ejemplo 1.

source: Here is a list of hashes which are currently supported by mhash.
es: Aqui hay una lista de hashes que esta actualmente soportada por mhash.

source: MHASH_MD5
es: Si un hash no esta en dicha lista pero aparece como soportado por mhash, entonces se asume con plena seguridad que esta documentacion esta desfasada.

source: MHASH_HAVAL192
es: MHASH_HAVAL

source: MHASH_GOST
es: MHASH_RIPEMD128

source: MHASH_CRC32
es: MHASH_SNEFRU

source: Example 1. built into php (unix)
es: Ejemplo 1. built into php (unix)

source: The classes below are defined by this extension, and will only be available when the extension has either been compiled into PHP or dynamically loaded at runtime.
es: Estas clases están definidas por esta extensión y estarán disponibles cuando la extensión haya sido compilada dentro de PHP o dinámicamente cargable en tiempo de ejecución

source: mssql_select_db
es: SWFMovie - setframes - - Sets the total number of frames in the animation.

source: ming_setcubicthreshold
es: SWFTextField - setMargins - - Sets the margins width of the text field.

source: See also ignore_user_abort().
es: Estas funciones están colacadas aquí debido a que no parecen ajustarse a ninguna otra categoría.

source: More information about mSQL can be found at http: / /www.hughes.com.au /.
es: Manual de PHP

source: DIR is the mSQL base install directory, defaults to / usr / local / Hughes.
es: Anterior

source: In order to enable this module on a Windows environment, you must copy msql.dll from the DLL folder of the PHP / Win32 binary package to the SYSTEM32 folder of your windows machine. (Ex:
es: Siguiente

source: Requirements for WIn32 platforms.
es: Manual de PHP

source: The Client Tools can be installed from the MS SQL Server CD or by copying ntwdblib.dll from \winnt\system32 on the server to \winnt\system32 on the PHP box.
es: Anterior

source: Configuration of the client will require installation of all the tools.
es: Siguiente

source: To use the MSSQL extension on Unix / Linux, you first need to build and install the FreeTDS library.
es: Anterior

source: The MSSQL extension is enabled by adding extension=php_mssql.dll to php.ini.
es: Inicio

source: mssql.min_error_severity
es: Subir

source: Users who run other applications that use MySQL (for example, running PHP 3 and PHP 4 as concurrent apache modules, or auth-mysql) should always specify the path to MySQL: --with-mysql= / path / to / mysql.
es: Estas funciones le permiten acceder a servidores de bases de datos MySQL.

source: If no default is specified, the port will be obtained from the MYSQL_TCP_PORT environment variable, the mysql-tcp entry in / etc / services or the compile-time MYSQL_PORT constant, in that order.
es: Puede encontrar más información sobre MySQL en http: / /www.mysql.com /.

source: Table 2. ncurses color constants
es: Tabla 2. ncurses color constants

source: Table 3. ncurses key constants
es: Tabla 3. ncurses key constants

source: Table 4. mouse constants
es: Tabla 4. mouse constants

source: Whether or not to define the various syslog variables (e.g. $LOG_PID, $LOG_CRON, etc.).
es: Siguiente

source: At runtime, you can define these variables by calling define_syslog_variables().
es: Anterior

source: LOG_NDELAY
es: Siguiente

source: Table 3. syslog() Priorities (in descending order)
es: Subir

source: For more information refer to the NIS manpage and The Linux NIS( YP) / NYS / NIS + HOWTO.
es: NIS (anteriormente llamado Paginas Amarillas) permite la administracion de red de los archivos de administracion importantes (e.g.El archivo de contraseñas).

source: To get these functions to work, you have to configure PHP with --enable-yp.
es: Introduccion a YP / NIS Hay tambien un libro llamado gestionando NFS Y NIS por Hal Stern.

source: ncurses_wrefresh
es: Siguiente

source: Example 3. storage_classes.inc
es: Ejemplo 3. storage_classes.inc

source: Example 4. test_aggregation.php
es: Ejemplo 4. test_aggregation.php

source: It uses the Oracle8 Call-Interface (OCI8)
es: Estas funciones permiten acceder a bases de datos Oracle8 y Oracle7.

source: This extension is more flexible than the standard Oracle extension.
es: Estas usan la Oracle8 Call-Interface (OCI8).

source: It supports binding of global and local PHP variables to Oracle placeholders, has full LOB, FILE and ROWID support and allows you to use user-supplied define variables.
es: Necesitará las librerías clientes de Oracle8 para usar esta extensión.

source: You will need the Oracle8 client libraries to use this extension.
es: Esta extensión es más flexible que las estándar de Oracle.

source: The variables you might need to set are as follows:
es: Soporta el enlace de variables locales y globales de PHP con placeholders de Oracle, tiene soporte completo para LOB, FILE y ROWID y le permiten usar las variables definidas por el usuario.

source: ORACLE_SID
es: OCIColumnPrecision

source: LD_LIBRARY_PATH
es: OCIColumnTypeRaw

source: After setting up the environment variables for your webserver user, be sure to also add the webserver user (nobody, www) to the oracle group.
es: Si no ocurre ningún error devuelve falso.

source: If your webserver doesn 't start or crashes at startup:
es: OCIExecute

source: Check that Apache is linked with the pthread library:
es: OCIFreeCollection

source: If the libpthread is not listed you have to reinstall Apache:
es: OCIFreeDesc

source: Please note that on some systems like UnixWare it is libthread instead of libpthread.
es: OCIInternalDebug - - Habilita o deshabilita la salida del depurador interno.

source: PHP and Apache have to be configured with EXTRA_LIBS=-lthread.
es: OCINewDescriptor

source: ?php / / by sergo@bacup.ru / / Use option:
es: Devuelve una nueva sesión.

source: You can easily access stored procedures in the same way as you would from the commands line.
es: OCIResult

source: Using Stored Procedures
es: OCISetPrefetch

source: OCIBindByName ($sth, ":address_id", $addr_id, 10); OCIBindByName ($sth, ":error_code", $errorcode, 10); OCIExecute ($sth);?
es: OCIWriteLobToFile - - Coming soon

source: Instead of maintaining multiple database drivers that were all nearly identical, these drivers have been unified into a single set of ODBC functions.
es: Devuelve FALSE en caso de error, en otro caso TRUE

source: More information on iODBC, as well as a HOWTO, is available at www.iodbc.org.
es: Returns a result identifier containing the information.

source: This extension adds support for Oracle database server access.
es: Siguiente

source: See also the OCI8 extension.
es: Anterior

source: openssl_x509_read
es: Subir

source: For example, if you set output_handler to mb_output_handler(), character encoding will be transparently converted to the specified encoding.
es: Ejemplo 1.

source: You 'll need to install the sqlcli library available in the Ovrimos SQL Server distribution.
es: To enable ovrimos support in PHP just compile php with the '--with-ovrimos' parameter to configure script.

source: DIR is the Ovrimos' libsqlcli install directory.
es: Ejemplo 1.

source: The expression should be enclosed in the delimiters, a forward slash (/), for example.
es: La sintaxis, para los patrones usados en estas funciones, es muy semejante al Perl.

source: If the delimiter character has to be used in the expression itself, it needs to be escaped by backslash.
es: Las expresiones estarán encerradas por delimitadores, por ejemplo una barra de dividir (/).

source: The ending delimiter may be followed by various modifiers that affect the matching.
es: Cualquier carácter puede ser usado para delimitar incluso los que no son caracteres alfanuméricos o la barra invertida (\).
